app/controllers/application_controller.rb

    def set_current_user
        if session[:user_id] # check is there is any USER ID in this session
            Current.user = User.find_by(id: session[:user_id]) # if yes then look up the database user with the USER ID value, find_by will not throw error if the user does not exist
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]