app/controllers/passwords_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2022-02-27 10:42:10.571158"], ["id", 2]]
---
    def update
        if Current.user.update(password_params)