app/controllers/registrations_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "Kelvin"], ["password_digest", "[FILTERED]"], ["created_at", "2022-02-26 14:51:47.794632"], ["updated_at", "2022-02-26 14:51:47.794632"]]
---
    def create
        @user = User.new(user_params) # take the USER parameter from the FORM, and save the record into the "User" database
        if @user.save